#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");

	//-------------------------------САМА ПРОГА-------------------------------------

	int x, y;

	cout << "Введите координаты точки: " << endl;
	cout << "X = ";
	cin >> x;
	cout << "Y = ";
	cin >> y;

	if (x > 0 && y > 0)
	{
		cout << " Точка в 1 четверти ";
	}
	else if (x < 0 && y > 0)
	{
		cout << "точка во 2 четверти ";
	}
	else if (x < 0 && y < 0)
	{
		cout << "Точка в 3 четверти";
	}
	else if (x > 0 && y < 0)
	{
		cout << "Точка в 4 четверти";
	}
	else if (x == 0 || y == 0)
	{
		cout << "Точка в центре координат или на одной из осей";
	}

	cout << endl << endl;

	system("pause");

	return 0;

}
